{
  "backend/main.mo": "Actor handling user profiles with access control and a lead submission system, allowing admins to view all hamper leads.",
  "feature_evidence.json": "Feature evidence report mapping landing page features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend files and their roles in the landing page.",
  "frontend/index.css": "Tailwind base style configuration defining CSS variables for light/dark themes and global border/background styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React component composing all landing page sections in order.",
  "frontend/src/components/landing/ArtisanValuesSection.tsx": "Section presenting brand artisan values using cards with icons and descriptive text.",
  "frontend/src/components/landing/CuratedHampersSection.tsx": "Section displaying curated hamper cards with images, descriptions, and a CTA that scrolls to customization.",
  "frontend/src/components/landing/CustomizeExplainerSection.tsx": "Four-step visual explainer of the customization process using icon cards.",
  "frontend/src/components/landing/CustomizeFormSection.tsx": "Form component that validates user inputs and submits custom hamper requests, showing a success message after submission.",
  "frontend/src/components/landing/FAQSection.tsx": "Renders an accordion-based FAQ list describing processes, shipping, and policies.",
  "frontend/src/components/landing/FinalCTASection.tsx": "Displays a final call-to-action section that logs clicks and scrolls users to the customization form.",
  "frontend/src/components/landing/FooterSection.tsx": "Footer with brand info, contact links, and dialogs for shipping and returns policies.",
  "frontend/src/components/landing/HeroSection.tsx": "Hero banner with background image, trust badges, headline, and CTAs that trigger analytics and scrolling.",
  "frontend/src/components/landing/TestimonialsSection.tsx": "Shows a grid of customer testimonials with names, roles, ratings, and quotes.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity state, login flow, and status tracking.",
  "frontend/src/hooks/useSubmitHamperLead.ts": "Defines a mutation hook that submits a hamper lead via an actor and refreshes the leads query on success.",
  "frontend/src/index.css": "Defines global styles, fonts, Tailwind layers, and theme variables for a warm artisan design with light/dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/src/utils/analytics.ts": "Contains placeholder analytics logging functions for CTA clicks and form submission events.",
  "frontend/src/utils/scrollToSection.ts": "Provides a smooth scrolling helper to navigate to DOM sections with an offset.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, plugins, and container settings.",
  "project_state.json": "Stores project metadata, requirements, existing features, and image needs for the landing page project."
}